app/graphql/mutations/create_link.rb

    def resolve(description: nil, url: nil)
      Link.create!(
        description: description,
        url: url,
      )
---
INSERT INTO "links" ("url", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["url", "http://npmjs.com/package/graphql-tools"], ["description", "Best tools"], ["created_at", "2023-11-30 20:58:27.369790"], ["updated_at", "2023-11-30 20:58:27.369790"]]